ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_cpu_per_cfg_regs.xml
<module id="CPU_PER_CFG_REGS" HW_revision="" description="CPU PER CFG Registers">
	<register id="CPUPERCFGLOCK1" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="Lock bit for CPUx_PER_CFG registers">
		<bitfield id="PCLKCR0" description="Lock bit for PCLKCR0 Register" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR1" description="Lock bit for PCLKCR1 Register" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR2" description="Lock bit for PCLKCR2 Register" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR3" description="Lock bit for PCLKCR3 Register" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR4" description="Lock bit for PCLKCR4 Register" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR6" description="Lock bit for PCLKCR6 Register" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR7" description="Lock bit for PCLKCR7 Register" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR8" description="Lock bit for PCLKCR8 Register" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR9" description="Lock bit for PCLKCR9 Register" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR10" description="Lock bit for PCLKCR10 Register" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR13" description="Lock bit for PCLKCR13 Register" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR14" description="Lock bit for PCLKCR14 Register" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR16" description="Lock bit for PCLKCR16 Register" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR17" description="Lock bit for PCLKCR17 Register" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR18" description="Lock bit for PCLKCR18 Register" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR19" description="Lock bit for PCLKCR19 Register" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR20" description="Lock bit for PCLKCR20 Register" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR21" description="Lock bit for PCLKCR21 Register" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR23" description="Lock bit for PCLKCR23 Register" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR25" description="Lock bit for PCLKCR25 Register" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR27" description="Lock bit for PCLKCR27 Register" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR28" description="Lock bit for PCLKCR28 Register" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR30" description="Lock bit for PCLKCR30 Register" begin="30" end="30" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUPERCFGLOCK2" width="32" page="0" offset="0x4" instances="1" instaddr="4" internal="0" description="Lock bit for CPUx_PER_CFG registers">
		<bitfield id="PCLKCR32" description="Lock bit for PCLKCR32 Register" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR0" width="32" page="0" offset="0x10" instances="1" instaddr="4" internal="0" description="Peripheral Clock Gating Registers">
		<bitfield id="RTDMA1" description="RTDMA1 Clock Enable Bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="RTDMA2" description="RTDMA2 Clock Enable Bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CPUTIMER0" description="CPUTIMER0 Clock Enable Bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CPUTIMER1" description="CPUTIMER1 Clock Enable Bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CPUTIMER2" description="CPUTIMER2 Clock Enable Bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="TBCLKSYNC" description="TBCLKSYNC Clock Enable Bit" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GTBCLKSYNC" description="GTBCLKSYNC Clock Enable Bit" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="CPUx_ERAD" description="CPUx_ERAD Clock Enable Bit" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="CPUx_DLT" description="CPUx_DLT Clock Enable Bit" begin="25" end="25" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR1" width="32" page="0" offset="0x14" instances="1" instaddr="4" internal="0" description="Peripheral Clock Gating Register - EMIF">
		<bitfield id="EMIF1" description="EMIF1 Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR2" width="32" page="0" offset="0x18" instances="1" instaddr="4" internal="0" description="Peripheral Clock Gating Register - EPWM">
		<bitfield id="EPWM1" description="EPWM1 Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EPWM2" description="EPWM2 Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EPWM3" description="EPWM3 Clock Enable bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EPWM4" description="EPWM4 Clock Enable bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EPWM5" description="EPWM5 Clock Enable bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EPWM6" description="EPWM6 Clock Enable bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="EPWM7" description="EPWM7 Clock Enable bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="EPWM8" description="EPWM8 Clock Enable bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="EPWM9" description="EPWM9 Clock Enable bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="EPWM10" description="EPWM10 Clock Enable bit" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="EPWM11" description="EPWM11 Clock Enable bit" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="EPWM12" description="EPWM12 Clock Enable bit" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="EPWM13" description="EPWM13 Clock Enable bit" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="EPWM14" description="EPWM14 Clock Enable bit" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="EPWM15" description="EPWM15 Clock Enable bit" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="EPWM16" description="EPWM16 Clock Enable bit" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="EPWM17" description="EPWM17 Clock Enable bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="EPWM18" description="EPWM18 Clock Enable bit" begin="17" end="17" width="1" rwaccess="RW"/>
	</register>
