ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_cpu_per_cfg_regs.xml
	<register id="PCLKCR3" width="32" page="0" offset="0x1c" instances="1" instaddr="4" internal="0" description="Peripheral Clock Gating Register - ECAP">
		<bitfield id="ECAP1" description="ECAP1 Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ECAP2" description="ECAP2 Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ECAP3" description="ECAP3 Clock Enable bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ECAP4" description="ECAP4 Clock Enable bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ECAP5" description="ECAP5 Clock Enable bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ECAP6" description="ECAP6 Clock Enable bit" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR4" width="32" page="0" offset="0x20" instances="1" instaddr="4" internal="0" description="Peripheral Clock Gating Register - EQEP">
		<bitfield id="EQEP1" description="EQEP1 Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EQEP2" description="EQEP2 Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EQEP3" description="EQEP3 Clock Enable bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EQEP4" description="EQEP4 Clock Enable bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EQEP5" description="EQEP5 Clock Enable bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EQEP6" description="EQEP6 Clock Enable bit" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR6" width="32" page="0" offset="0x28" instances="1" instaddr="4" internal="0" description="Peripheral Clock Gating Register - SDFM">
		<bitfield id="SD1" description="SD1 Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SD2" description="SD2 Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SD3" description="SD3 Clock Enable bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SD4" description="SD4 Clock Enable bit" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR7" width="32" page="0" offset="0x2c" instances="1" instaddr="4" internal="0" description="Peripheral Clock Gating Register - SCI, UART">
		<bitfield id="UART_A" description="UART_A Clock Enable bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="UART_B" description="UART_B Clock Enable bit" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="UART_C" description="UART_C Clock Enable bit" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="UART_D" description="UART_D Clock Enable bit" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="UART_E" description="UART_E Clock Enable bit" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="UART_F" description="UART_F Clock Enable bit" begin="21" end="21" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR8" width="32" page="0" offset="0x30" instances="1" instaddr="4" internal="0" description="Peripheral Clock Gating Register - SPI">
		<bitfield id="SPI_A" description="SPI_A Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SPI_B" description="SPI_B Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SPI_C" description="SPI_C Clock Enable bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SPI_D" description="SPI_D Clock Enable bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SPI_E" description="SPI_E Clock Enable bit" begin="4" end="4" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR9" width="32" page="0" offset="0x34" instances="1" instaddr="4" internal="0" description="Peripheral Clock Gating Register - I2C">
		<bitfield id="I2C_A" description="I2C_A Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="I2C_B" description="I2C_B Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR10" width="32" page="0" offset="0x38" instances="1" instaddr="4" internal="0" description="Peripheral Clock Gating Register - CAN">
		<bitfield id="MCAN_A" description="MCAN_A Clock Enable bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MCAN_B" description="MCAN_B Clock Enable bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="MCAN_C" description="MCAN_C Clock Enable bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="MCAN_D" description="MCAN_D Clock Enable bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="MCAN_E" description="MCAN_E Clock Enable bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="MCAN_F" description="MCAN_F Clock Enable bit" begin="9" end="9" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR13" width="32" page="0" offset="0x44" instances="1" instaddr="4" internal="0" description="Peripheral Clock Gating Register - ADC">
		<bitfield id="ADC_A" description="ADC_A Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ADC_B" description="ADC_B Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ADC_C" description="ADC_C Clock Enable bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ADC_D" description="ADC_D Clock Enable bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ADC_E" description="ADC_E Clock Enable bit" begin="4" end="4" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR14" width="32" page="0" offset="0x48" instances="1" instaddr="4" internal="0" description="Peripheral Clock Gating Register - CMPSS">
		<bitfield id="CMPSS1" description="CMPSS1 Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS2" description="CMPSS2 Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS3" description="CMPSS3 Clock Enable bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS4" description="CMPSS4 Clock Enable bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS5" description="CMPSS5 Clock Enable bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS6" description="CMPSS6 Clock Enable bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS7" description="CMPSS7 Clock Enable bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS8" description="CMPSS8 Clock Enable bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS9" description="CMPSS9 Clock Enable bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS10" description="CMPSS10 Clock Enable bit" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS11" description="CMPSS11 Clock Enable bit" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS12" description="CMPSS12 Clock Enable bit" begin="11" end="11" width="1" rwaccess="RW"/>
	</register>
