ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_cpu_per_cfg_regs.xml
	<register id="PCLKCR16" width="32" page="0" offset="0x50" instances="1" instaddr="4" internal="0" description="Peripheral Clock Gating Register Buf_DAC">
		<bitfield id="DAC_A" description="DAC_A Clock Enable bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="DAC_B" description="DAC_B Clock Enable bit" begin="17" end="17" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR17" width="32" page="0" offset="0x54" instances="1" instaddr="4" internal="0" description="Peripheral Clock Gating Register - CLB">
		<bitfield id="CLB1" description="CLB1 Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLB2" description="CLB2 Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CLB3" description="CLB3 Clock Enable bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CLB4" description="CLB4 Clock Enable bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CLB5" description="CLB5 Clock Enable bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CLB6" description="CLB6 Clock Enable bit" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR18" width="32" page="0" offset="0x58" instances="1" instaddr="4" internal="0" description="Peripheral Clock Gating Register - FSI">
		<bitfield id="FSITX_A" description="FSITX_A Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FSITX_B" description="FSITX_B Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="FSITX_C" description="FSITX_C Clock Enable bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="FSITX_D" description="FSITX_D Clock Enable bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_A" description="FSIRX_A Clock Enable bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_B" description="FSIRX_B Clock Enable bit" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_C" description="FSIRX_C Clock Enable bit" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_D" description="FSIRX_D Clock Enable bit" begin="19" end="19" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR19" width="32" page="0" offset="0x5c" instances="1" instaddr="4" internal="0" description="Peripheral Clock Gating Register - LIN">
		<bitfield id="LIN_A" description="LIN_A Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LIN_B" description="LIN_B Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR20" width="32" page="0" offset="0x60" instances="1" instaddr="4" internal="0" description="Peripheral Clock Gating Register - PMBUS">
		<bitfield id="PMBUS_A" description="PMBUS_A Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR21" width="32" page="0" offset="0x64" instances="1" instaddr="4" internal="0" description="Peripheral Clock Gating Register - DCC">
		<bitfield id="DCC1" description="DCC1 Clock Enable Bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DCC2" description="DCC2 Clock Enable Bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DCC3" description="DCC3 Clock Enable Bit" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR23" width="32" page="0" offset="0x6c" instances="1" instaddr="4" internal="0" description="Peripheral Clock Gating Register - EtherCAT">
		<bitfield id="ETHERCAT" description="ETHERCAT Clock Enable Bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR25" width="32" page="0" offset="0x74" instances="1" instaddr="4" internal="0" description="Peripheral Clock Gating Register - HRCAL0,1,2">
		<bitfield id="HRCAL0" description="HRCAL0 Clock Enable Bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="HRCAL1" description="HRCAL1 Clock Enable Bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="HRCAL2" description="HRCAL2 Clock Enable Bit" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR27" width="32" page="0" offset="0x7c" instances="1" instaddr="4" internal="0" description="Peripheral Clock Gating Register - EPG">
		<bitfield id="EPG1" description="EPG1 Clock Enable Bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR28" width="32" page="0" offset="0x80" instances="1" instaddr="4" internal="0" description="Peripheral Clock Gating Register - ADCCHECKER">
		<bitfield id="ADCCHECKER1" description="ADCCHECKER1 Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER2" description="ADCCHECKER2 Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER3" description="ADCCHECKER3 Clock Enable bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER4" description="ADCCHECKER4 Clock Enable bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER5" description="ADCCHECKER5 Clock Enable bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER6" description="ADCCHECKER6 Clock Enable bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER7" description="ADCCHECKER7 Clock Enable bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER8" description="ADCCHECKER8 Clock Enable bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER9" description="ADCCHECKER9 Clock Enable bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER10" description="ADCCHECKER10 Clock Enable bit" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="ADCSEAGGRCPU1" description="ADCSEAGGRCPU1 Clock Enable bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="ADCSEAGGRCPU2" description="ADCSEAGGRCPU2 Clock Enable bit" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="ADCSEAGGRCPU3" description="ADCSEAGGRCPU3 Clock Enable bit" begin="18" end="18" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR30" width="32" page="0" offset="0x88" instances="1" instaddr="4" internal="0" description="Peripheral Clock Gating Register - SENT">
		<bitfield id="SENT1" description="SENT1 Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SENT2" description="SENT2 Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SENT3" description="SENT3 Clock Enable bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SENT4" description="SENT4 Clock Enable bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SENT5" description="SENT5 Clock Enable bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SENT6" description="SENT6 Clock Enable bit" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR32" width="32" page="0" offset="0x90" instances="1" instaddr="4" internal="0" description="Peripheral Clock Gating Register - WADI">
		<bitfield id="WADI1" description="WADI1 Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="WADI2" description="WADI2 Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES0" width="32" page="0" offset="0x110" instances="1" instaddr="4" internal="0" description="Processing Block Software Reset register">
		<bitfield id="CPUTIMER" description="Reset bit for modules CPUTIMER0, COUTIMER1 and CPUTIMER2" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CPUx_ERAD" description="CPUx_ERAD Module reset bit" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="CPUx_DLT" description="CPUx_DLT Module reset bit" begin="25" end="25" width="1" rwaccess="RW"/>
	</register>
