ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_cpu_per_cfg_regs.xml
	<register id="SOFTPRES1" width="32" page="0" offset="0x114" instances="1" instaddr="4" internal="0" description="EMIF Software Reset register">
		<bitfield id="EMIF1" description="EMIF1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES2" width="32" page="0" offset="0x118" instances="1" instaddr="4" internal="0" description="EPWM Software Reset register">
		<bitfield id="EPWM1" description="EPWM1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EPWM2" description="EPWM2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EPWM3" description="EPWM3 software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EPWM4" description="EPWM4 software reset bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EPWM5" description="EPWM5 software reset bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EPWM6" description="EPWM6 software reset bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="EPWM7" description="EPWM7 software reset bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="EPWM8" description="EPWM8 software reset bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="EPWM9" description="EPWM9 software reset bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="EPWM10" description="EPWM10 software reset bit" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="EPWM11" description="EPWM11 software reset bit" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="EPWM12" description="EPWM12 software reset bit" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="EPWM13" description="EPWM13 software reset bit" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="EPWM14" description="EPWM14 software reset bit" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="EPWM15" description="EPWM15 software reset bit" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="EPWM16" description="EPWM16 software reset bit" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="EPWM17" description="EPWM17 software reset bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="EPWM18" description="EPWM18 software reset bit" begin="17" end="17" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES3" width="32" page="0" offset="0x11c" instances="1" instaddr="4" internal="0" description="ECAP Software Reset register">
		<bitfield id="ECAP1" description="ECAP1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ECAP2" description="ECAP2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ECAP3" description="ECAP3 software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ECAP4" description="ECAP4 software reset bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ECAP5" description="ECAP5 software reset bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ECAP6" description="ECAP6 software reset bit" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES4" width="32" page="0" offset="0x120" instances="1" instaddr="4" internal="0" description="EQEP Software Reset register">
		<bitfield id="EQEP1" description="EQEP1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EQEP2" description="EQEP2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EQEP3" description="EQEP3 software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EQEP4" description="EQEP4 software reset bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EQEP5" description="EQEP5 software reset bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EQEP6" description="EQEP6 software reset bit" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES6" width="32" page="0" offset="0x128" instances="1" instaddr="4" internal="0" description="Sigma Delta Software Reset register">
		<bitfield id="SD1" description="SD1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SD2" description="SD2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SD3" description="SD3 software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SD4" description="SD4 software reset bit" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES7" width="32" page="0" offset="0x12c" instances="1" instaddr="4" internal="0" description="SCI, UART Software Reset register">
		<bitfield id="UART_A" description="UART_A software reset bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="UART_B" description="UART_B software reset bit" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="UART_C" description="UART_C software reset bit" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="UART_D" description="UART_D software reset bit" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="UART_E" description="UART_E software reset bit" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="UART_F" description="UART_F software reset bit" begin="21" end="21" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES8" width="32" page="0" offset="0x130" instances="1" instaddr="4" internal="0" description="SPI Software Reset register">
		<bitfield id="SPI_A" description="SPI_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SPI_B" description="SPI_B software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SPI_C" description="SPI_C software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SPI_D" description="SPI_D software reset bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SPI_E" description="SPI_E software reset bit" begin="4" end="4" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES9" width="32" page="0" offset="0x134" instances="1" instaddr="4" internal="0" description="I2C Software Reset register">
		<bitfield id="I2C_A" description="I2C_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="I2C_B" description="I2C_B software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES10" width="32" page="0" offset="0x138" instances="1" instaddr="4" internal="0" description="CAN Software Reset register">
		<bitfield id="MCAN_A" description="MCAN_A software reset bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MCAN_B" description="MCAN_B software reset bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="MCAN_C" description="MCAN_C software reset bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="MCAN_D" description="MCAN_D software reset bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="MCAN_E" description="MCAN_E software reset bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="MCAN_F" description="MCAN_F software reset bit" begin="9" end="9" width="1" rwaccess="RW"/>
	</register>
