ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_cpu_per_cfg_regs.xml
	<register id="SOFTPRES13" width="32" page="0" offset="0x144" instances="1" instaddr="4" internal="0" description="ADC Software Reset register">
		<bitfield id="ADC_A" description="ADC_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ADC_B" description="ADC_B software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ADC_C" description="ADC_C software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ADC_D" description="ADC_D software reset bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ADC_E" description="ADC_E software reset bit" begin="4" end="4" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES14" width="32" page="0" offset="0x148" instances="1" instaddr="4" internal="0" description="CMPSS Software Reset register">
		<bitfield id="CMPSS1" description="CMPSS1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS2" description="CMPSS2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS3" description="CMPSS3 software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS4" description="CMPSS4 software reset bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS5" description="CMPSS5 software reset bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS6" description="CMPSS6 software reset bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS7" description="CMPSS7 software reset bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS8" description="CMPSS8 software reset bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS9" description="CMPSS9 software reset bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS10" description="CMPSS10 software reset bit" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS11" description="CMPSS11 software reset bit" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS12" description="CMPSS12 software reset bit" begin="11" end="11" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES16" width="32" page="0" offset="0x150" instances="1" instaddr="4" internal="0" description="DAC Software Reset register">
		<bitfield id="DAC_A" description="DAC_A software reset bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="DAC_B" description="DAC_B software reset bit" begin="17" end="17" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES17" width="32" page="0" offset="0x154" instances="1" instaddr="4" internal="0" description="CLB Software Reset register">
		<bitfield id="CLB1" description="CLB1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLB2" description="CLB2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CLB3" description="CLB3 software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CLB4" description="CLB4 software reset bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CLB5" description="CLB5 software reset bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CLB6" description="CLB6 software reset bit" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES18" width="32" page="0" offset="0x158" instances="1" instaddr="4" internal="0" description="FSI Software Reset register">
		<bitfield id="FSITX_A" description="FSITX_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FSITX_B" description="FSITX_B software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="FSITX_C" description="FSITX_C software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="FSITX_D" description="FSITX_D software reset bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_A" description="FSIRX_A software reset bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_B" description="FSIRX_B software reset bit" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_C" description="FSIRX_C software reset bit" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_D" description="FSIRX_D software reset bit" begin="19" end="19" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES19" width="32" page="0" offset="0x15c" instances="1" instaddr="4" internal="0" description="LIN Software Reset register">
		<bitfield id="LIN_A" description="LIN_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LIN_B" description="LIN_B software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES20" width="32" page="0" offset="0x160" instances="1" instaddr="4" internal="0" description="PMBUS Software Reset register">
		<bitfield id="PMBUS_A" description="PMBUS_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES21" width="32" page="0" offset="0x164" instances="1" instaddr="4" internal="0" description="DCC Software Reset register">
		<bitfield id="DCC1" description="DCC Module reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DCC2" description="DCC Module reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DCC3" description="DCC Module reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES23" width="32" page="0" offset="0x16c" instances="1" instaddr="4" internal="0" description="ETHERCAT Software Reset register">
		<bitfield id="ETHERCAT" description="ETHERCAT Module reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES25" width="32" page="0" offset="0x174" instances="1" instaddr="4" internal="0" description="HRCAL0,1,2 Software Reset register">
		<bitfield id="HRCAL0" description="HRCAL0 Module reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="HRCAL1" description="HRCAL1 Module reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="HRCAL2" description="HRCAL2 Module reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES27" width="32" page="0" offset="0x17c" instances="1" instaddr="4" internal="0" description="EPG Software Reset register">
		<bitfield id="EPG1" description="EPG Module Reset Bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES28" width="32" page="0" offset="0x180" instances="1" instaddr="4" internal="0" description="ADCCHECKER Software Reset register">
		<bitfield id="ADCCHECKER1" description="ADCCHECKER1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER2" description="ADCCHECKER2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER3" description="ADCCHECKER3 software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER4" description="ADCCHECKER4 software reset bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER5" description="ADCCHECKER5 software reset bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER6" description="ADCCHECKER6 software reset bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER7" description="ADCCHECKER7 software reset bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER8" description="ADCCHECKER8 software reset bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER9" description="ADCCHECKER9 software reset bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER10" description="ADCCHECKER10 software reset bit" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="ADCSEAGGRCPU1" description="ADCSEAGGRCPU1 software reset bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="ADCSEAGGRCPU2" description="ADCSEAGGRCPU2 software reset bit" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="ADCSEAGGRCPU3" description="ADCSEAGGRCPU3 software reset bit" begin="18" end="18" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES30" width="32" page="0" offset="0x188" instances="1" instaddr="4" internal="0" description="SENT Software Reset register">
		<bitfield id="SENT1" description="SENT1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SENT2" description="SENT2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SENT3" description="SENT3 software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SENT4" description="SENT4 software reset bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SENT5" description="SENT5 software reset bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SENT6" description="SENT6 software reset bit" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES32" width="32" page="0" offset="0x190" instances="1" instaddr="4" internal="0" description="WADI Software Reset register">
		<bitfield id="WADI1" description="WADI1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="WADI2" description="WADI2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="PARITY_TEST_ALT1" width="32" page="0" offset="0x1b8" instances="1" instaddr="4" internal="0" description="Enables parity test">
		<bitfield id="TESTEN" description="Parity test enable configuration" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
</module>
